prof_repo/ProfilPortant/TD2_NACA_Profil/simpleFoam_alpha5/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform $flowVelocity;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform (0 0 0);
        value       uniform $flowVelocity;
    }

    wing
    {
        type        noSlip;
    }

    #include "include/frontBackTopBottomPatches"
}

// ************************************************************************* //
